Revit 2027 API
View.SetCategoryHidden Method
 Sets if elements of the given category will be visible in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCategoryHidden(
	ElementId categoryId,
	bool hide
)
Public Sub SetCategoryHidden (
	categoryId As ElementId,
	hide As Boolean
)
public:
void SetCategoryHidden(
	ElementId^ categoryId,
	bool hide
)
member SetCategoryHidden :
        categoryId : ElementId *
        hide : bool -> unit
Parameters
categoryId ElementId
 The ID of the category.
hide Boolean
 True to make elements of this category invisible, false to make them visible.
Exceptions
Exception | Condition
ArgumentException |  categoryId does not correspond to a Category. -or- Category cannot be hidden.
ArgumentNullException |  A non-optional argument was null
Remarks
 This affects only if the category is set visible or invisible individually. Other Revit mechanisms may also affect the visibility of elements of this category, including:
 The category classes settings for model categories, annotation categories, import categories or analytical model categories.
 View filters.
 Elements hidden individually in the view.
 Thus setting this value may not affect the actual visibility of elements of this category in the view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace